# Напишите ваше решение
a = int(input('Введите число, которое нужно возвезти в степень: '))
b = int(input('Введите число, в какую степень нужно возвезти предыдущее число: '))
c = a ** b
print(c)