# Напишите ваше решение
number_1 = int(input('Введите первое число: '))
number_2 = int(input('Введите второе число: '))
number_3 = int(input('Введите третье число: '))

min_number = min(number_1, number_2, number_3)

print(str(min_number) + ' - минимальное число')