# Напишите ваше решение
money = int(input("Введите свою заработную плату: "))
tax = 0.13
print(money * tax)
print(money - money * tax)

